transports/car/case_b/constant/battery0_0/radiationProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object radiationProperties;
}

radiation on;

radiationModel solarLoad;

solarLoadCoeffs
{
  sunDirectionModel sunDirTracking;
  sunTrackingUpdateInterval 600; 	// Sun direction ray model. Give the sunDirection or calculated using the// (solar calculator)//sunDirConstant//sunDirectionModel   sunDirConstant;// Time interval to update Sun position (sec)// sunDirection        (0 0 -1);
  localStandardMeridian 1.0; 	// GMT offset (hours)
  startDay 61; 	// day of the year
  startTime 6.383333333333334; 	// time of the day (hours decimal)
  longitude 11.646968; 	// longitude (degrees)
  latitude 48.26422; 	// latitude (degrees)// Grid orientation
  gridUp (0 0 1);
  gridEast (0.998435 -0.055932 0); 	// Energy spectrum
  spectralDistribution
    (
      1
      1
    ); 	// spectralDistribution   (0);// Solar model:// sunLoadConstant-sunLoadFairWeatherConditions-SunLoadTheoreticalMaximum;// sunLoadModel sunLoadConstant;
  sunLoadModel sunLoadFairWeatherConditions; 	// Sun load constant model// directSolarRad  1000;    // [w/m2]// diffuseSolarRad 40;     // [w/m2]// // Fair Weather Conditions Model Constants.// Calculate beta from the Solar calculator or input
  skyCloudCoverFraction 1;
  A 1000; 	// Apparent solar irradiation at air mass m = 0
  B 0.142; 	// Atmospheric extinction coefficient// beta    45;         // Solar altitude (in degrees) above the horizontal// // Theoretical maximum model constants// Setrn       10;// SunPrime    1;// // Ground reflectivity
  groundReflectivity 0.2; 	// // Solar diffusivity constants
  C 0.058; 	// Model constant// Radiative flux coupling flags
  solidCoupled yes;
  wallCoupled yes;
  useReflectedRays no;
  reflecting
  {
    nPhi 10;
    nTheta 10;
  }
  absorptionEmissionModel none;
  scatterModel none;
  sootModel none;
} 	// Number of flow iterations per radiation iteration

solverFreq 5;

absorptionEmissionModel none;

scatterModel none;

sootModel none; 	// ************************************************************************* //

