transports/car/case_b/constant/battery0_0/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object thermophysicalProperties;
}

thermoType
{
  type heSolidThermo;
  mixture pureMixture;
  transport constAnIso;
  thermo hConst;
  equationOfState rhoConst;
  specie specie;
  energy sensibleEnthalpy;
}

coordinateSystem
{
  type cartesian;
  origin (0 0 0); 	// Specifies direction for anisotrop thermal conductivity
  coordinateRotation
  {
    type axesRotation;
    e1 (1 0 0);
    e2 (0 1 0);
  }
}

mixture
{
  specie
  {
    molWeight 50;
  }
  transport
  {
    kappa (0.48 0.48 21);
  }
  thermodynamics
  {
    Hf 0;
    Cp 1243.0;
  }
  equationOfState
  {
    rho 1517.0068027210884;
  }
} 	// ************************************************************************* //

