transports/car/case_b/constant/regionProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object regionProperties;
}

regions
  (
    fluid

    (
    )
    solid

    (
      battery0_0
    )
  );



// ************************************************************************* //