transports/car/case_b/system/airInside/changeDictionaryDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object changeDictionaryDict;
}

boundary
{
}

T
{
  boundaryField
  {
    carrier
    {
      type externalWallHeatFluxTemperature;
      mode coefficient;
      Ta 285;
      h 2;
      kappaMethod fluidThermo; 	// thicknessLayers (0.02);// kappaLayers     (44);
      qr qr;
      value uniform 293.15;
      kappaLayers
        (
          1
        );
      thicknessLayers
        (
          1
        );
    }
    bottom
    {
      type zeroGradient;
    } 	// carrier_left// {//     type            externalWallHeatFluxTemperature;//     mode            coefficient;//     Ta              285;//     h               10;//     kappaMethod     fluidThermo;//     qr              qr;//     value           $internalField;// }// carrier_right// {//     type            externalWallHeatFluxTemperature;//     mode            coefficient;//     Ta              285;//     h               10;//     kappaMethod     fluidThermo;//     qr              qr;//     value           $internalField;// }// carrier_front// {//     type            externalWallHeatFluxTemperature;//     mode            coefficient;//     Ta              285;//     h               10;//     kappaMethod     fluidThermo;//     qr              qr;//     value           $internalField;// }// carrier_back// {//     type            externalWallHeatFluxTemperature;//     mode            coefficient;//     Ta              285;//     h               10;//     kappaMethod     fluidThermo;//     qr              qr;//     value           $internalField;// }// carrier_top// {//     type            externalWallHeatFluxTemperature;//     mode            coefficient;//     Ta              285;//     h               10;//     kappaMethod     fluidThermo;//     qr              qr;//     value           $internalField;// }// carrier_bottom// {//     type            zeroGradient;// }// type            externalWallHeatFluxTemperature;// mode            coefficient;// Ta              uniform 293.15;// h               uniform 10e5;// kappaMethod     fluidThermo;// kappa           none;// thicknessLayers (1 2);// kappaLayers     (100 200);// value           uniform 293.15;
  }
}

