transports/car/case_b/system/battery0_0/changeDictionaryDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object changeDictionaryDict;
}

T
{
  boundaryField
  {
    battery0_0_to_airInside
    {
      Ta 298.15;
      alphaAni Anialpha;
      h 2;
      kappaLayers ( 1 );
      kappaMethod directionalSolidThermo;
      mode coefficient;
      thicknessLayers ( 1 );
      type externalWallHeatFluxTemperature;
      value uniform 293.15;
    }
  }
}

p
{
  internalField uniform 100000;
  boundaryField
  {
  }
} 	// ************************************************************************* //

