transports/car/case_b/system/battery_template/changeDictionaryDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object changeDictionaryDict;
}

T
{
  internalField uniform 297.15;
  boundaryField
  {
    carrier
    {
      type zeroGradient;
    }
    battery0_0_to_airInside
    {
      type compressible::turbulentTemperatureCoupledBaffleMixed;
      Tnbr T; 	// thicknessLayers (0.05);// kappaLayers     (0.053);
      kappaMethod directionalSolidThermo;
      alphaAni Anialpha;
      value $internalField;
    }
  }
}

p
{
  internalField uniform 100000;
  boundaryField
  {
  }
} 	// ************************************************************************* //

