transports/car/case_b/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

scale 1;

length 5.12;

width 1.6;

height 3.2;

negWidth -1.6;

negLength 0;

negHeight 0;

vertices
  (

    (
      $length
      $negWidth
      $negHeight
    )

    (
      $length
      $width
      $negHeight
    )

    (
      $negLength
      $width
      $negHeight
    )

    (
      $negLength
      $negWidth
      $negHeight
    )

    (
      $length
      $negWidth
      $height
    )

    (
      $length
      $width
      $height
    )

    (
      $negLength
      $width
      $height
    )

    (
      $negLength
      $negWidth
      $height
    )
  ); 	// 0// 1// 2// 3// 4// 5// 6// 7//block size 32x32x32cm

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (10 16 10)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

patches
  (
    patch
    top

    (

      (
        4
        5
        6
        7
      )
    )
    patch
    right

    (

      (
        1
        2
        6
        5
      )
    )
    patch
    front

    (

      (
        0
        1
        5
        4
      )
    )
    patch
    back

    (

      (
        3
        7
        6
        2
      )
    )
    patch
    left

    (

      (
        0
        4
        7
        3
      )
    )
    patch
    bottom

    (

      (
        0
        3
        2
        1
      )
    )
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

