transports/car/case_b/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application chtMultiRegionFoam;

startFrom latestTime;

startTime 0.001;

stopAt endTime;

endTime 29242.0;

deltaT 1;

writeControl adjustable;

writeInterval 172.0;

purgeWrite 0;

writeFormat ascii;

writePrecision 8;

writeCompression yes;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
maxCo 32; 	// Maximum diffusion number

maxDi 10.0;

adjustTimeStep no;
functions
{
  wallHeatFlux
  {
    type wallHeatFlux;
    libs
      (
        "fieldFunctionObjects"
      );
    region airInside;
    qr qr;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
    enabled no;
  }
  wallTemperature_airInside
  {
    type surfaceFieldValue;
    libs
      (
        "fieldFunctionObjects"
      );
    enabled no;
    region airInside;
    fields
      (
        T
      );
    operation areaAverage;
    regionType patch;
    name carrier;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  }
  average_airInside
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      ); 	// enabled         false;
    region airInside;
    fields
      (
        T
      );
    operation volAverage;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
    enabled no;
  }
  min_airInside
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      ); 	// enabled         false;
    region airInside;
    fields
      (
        T
      );
    operation min;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
    enabled no;
  }
  max_airInside
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      ); 	// enabled         false;
    region airInside;
    fields
      (
        T
      );
    operation max;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
    enabled no;
  }
  wallTemperature_battery0_0
  {
    type surfaceFieldValue;
    libs
      (
        "fieldFunctionObjects"
      );
    enabled yes;
    region battery0_0;
    fields
      (
        T
      );
    operation areaAverage;
    regionType patch;
    name battery0_0_to_airInside;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  }
  average_battery0_0
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      );
    region battery0_0;
    fields
      (
        T
      );
    operation volAverage;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  }
  min_battery0_0
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      );
    region battery0_0;
    fields
      (
        T
      );
    operation min;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  }
  max_battery0_0
  {
    type volFieldValue;
    libs
      (
        "fieldFunctionObjects"
      );
    region battery0_0;
    fields
      (
        T
      );
    operation max;
    regionType all;
    writeFields no;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  } 	// //finds minimal and maximal Values in batteries region// minMaxValues// {//     type        fieldMinMax;//     libs        ("libfieldFunctionObjects.so");//     region      airOutside;//     write       false;//     fields      (T);// }//     //controls simulation during runtime//     runTimeControl//     {//         type        runTimeControl;//         libs        ("libutilityFunctionObjects.so");//         region      batteries;//         conditions//         {//             // if minimal temperature exceeds value, simulation stops//             minTempExceeded//             {//                 type            minMax;//                 functionObject  minMaxValues;//                 fields          (min(T));//                 mode            maximum;//                 value           272;//             }//         }//     }
} 	// ************************************************************************* //

