transports/car/case_b/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    top;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 -2 2.3855);
            max (7 2 2.3855);
        }
    }
    {
        name    right;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 1.2205 0);
            max (7 1.2205 3);
        }
    }
    {
        name    left;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 -1.2195 0);
            max (7 -1.2195 3);
        }
    }
    {
        name    back;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 -1.5 0);
            max (0 1.5 3);
        }
    }
    {
        name    front;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 -1.5 0);
            max (0 1.5 3);
        }
    }
);

// ************************************************************************* //
